app/controllers/applications_controller.rb

  def create
    @application = Application.new(application_params)

    respond_to do |format|
      if @application.save
---
INSERT INTO "applications" ("first_name", "last_name", "email", "phone", "location", "age", "reason_for_interest", "educational_background", "employment_background", "code_experience", "foreign_languages", "travel_experience", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

    def set_application
      @application = Application.find(params[:id])
---
SELECT  "applications".* FROM "applications" WHERE "applications"."id" = $1 LIMIT 1  [["id", 1]]